interface Blogs_dataProps {
    id: number
    title: string
    blogs_text: string
}


export const Blogs_data: Blogs_dataProps[] = [
  {
    id: 1,
    title: "Курс по HTML/CSS. Создание центрированного макета",
    blogs_text: "Ассаламу алейкум ва рахьматуллах1.\n" +
        "\n" +
        "Записал по моему мнению прикольное видео, которое можно отправлять своим знакомым и друзьям.\n" +
        "буду рад, если будете делиться данным видео, с кем нибудь из своих знакомых.\n" +
        "\n" +
        "\n" +
        "Данное видео подойдет для тех кто хотел бы попробовать себя в программировании, понять что можно делать при помощи веб-разработки благодаря моему обучению, создав вместе со мной свой первый центрированный макет сайта.\n" +
        "\n" +
        "Это видео только максимально в ознакомительных целях, чтобы дать понять людям, что можно делать при помощи фронтент-разработки.\n" +
        "\n" +
        "Примечание*\n" +
        "Я там особо ничего не объясняю, поэтому не ждите что я прям детаааально буду все все все объяснять!\n" +
        "\n" +
        "Оно в свободном доступе, каждый сможет посмотреть!\n" +
        "\n" +
        "\n" +
        "Ссылка на видео:\n" +
        "https://youtu.be/W8oFWhyTT4E",
  },
  {
    id: 2,
    title: "Lincode-Avito",
    blogs_text: "Привет друзья🔥\n" +
        "\n" +
        "и так хочу поделиться процессом работы над материалом по проекту «демо-авито»👨🏻‍💻\n" +
        "\n" +
        "На данный момент практический написаны руководства по 2 этапам, это у нас «Этап 0, Этап 1».📃\n" +
        "\n" +
        "Так же уже создан макет в Figma, с 3 страницами, это у нас «Главная, открытое объявление, Сообщения».📃\n" +
        "\n" +
        "🗓 Сейчас в ближайшие дни начнется работа над другими страницами нашего проекта, на подходе у нас:\n" +
        "\n" +
        "1. Страница с настройками пользователя 📈\n" +
        "2. Страница с редактированием профиля📈\n" +
        "3. Страница размещения объявлений📈\n" +
        "4. Страница редактирования объявлений📈\n" +
        "\n" +
        "На ближайшее время запланировано сделать макеты этих 4-ех страниц.\n" +
        "\n" +
        "Далее в планах, расписать весь 1-ый этап, и начать 2-ой этап.\n" +
        "\n" +
        "Поддерживайте данный проект и данную работу реакциями «🔥» и «👨🏻‍💻».\n" +
        "\n" +
        "Так же делитесь каналом со своими друзьями, чем больше народу будет заинтересовано в моей деятельности, тем больше и чаще я буду показывать много всего интересного из Мира-IT🔥\n" +
        "\n" +
        "Такая поддержка для меня будет мотивацией чтобы продолжать создавать для вас такие интересные проекты друзья.\n" +
        "\n" +
        "Вам не сложно а мне приятно☺️",
  },
  {
    id: 3,
    title: "Lincode-Avito",
    blogs_text: "Привет народ🔥\n" +
        "Снова делюсь с вами прогрессом нашей работы над проектом \"демо-авито\"\n" +
        "\n" +
        "Сейчас на данный момент уже реализованы макеты \"Сообщение, настройки профиля(настройки пользователя в минимальной версии конечно), главная страница, страница открытого объявления\".\n" +
        "\n" +
        "Так же мы уже подготовили материал по \" ЭТАП 0, ЭТАП 1, ЭТАП 2\".\n" +
        "\n" +
        "Затем мы уже записали 2 видео по реализации верстки, на первых порах мы растянули процесс на 3 дня, дабы показать как все делается на самом деле.\n" +
        "\n" +
        "теперь же когда мы закончили верстать главную страницу, остальные страницы мы будем верстать куда быстрее и не будем делить 1 страницу на несколько видео\n" +
        "\n" +
        "На подходе у нас подготовка материала 3 этапа, ну и конечно же запись видео по данным этапам\n" +
        "\n" +
        "поддержите нашу работу разными реакциями🔥🔥\n" +
        "\n" +
        "Мы будем очень благодарны если вы будете активничать у нас в канале, если вы будете делиться нашим каналом со всеми своими знакомыми, родными и близкими))\n" +
        "вы есть наша поддержка!)\n" +
        "\n" +
        "вам не сложно а нам приятно родные☺️",
  },
  {
    id: 4,
    title: "Экзамен по модулю HTML/CSS",
    blogs_text: "Хэй гайс🔥\n" +
        "\n" +
        "Так же хотел бы поделиться с вами небольшим рабочим моментом👨🏻‍💻\n" +
        "\n" +
        "Паралельно со всей работой, вчера мы приняли экзамен по первому модулю «HTML/CSS» у нашего студента\n" +
        "\n" +
        "На наше удивление студент сдал экзамен на отлично ответив на все 55 вопросов из экзамена🔥\n" +
        "\n" +
        "Данный экзамен проводится на понимание в теории того что пишут сами студенты, на понимание того как они понимают теги которые они используют для реализации тех или иных домашних задании\n" +
        "\n" +
        "Ошибиться во время экзамена это не плохо!\n" +
        "Потому что я всегда могу подкорректировать ваш ответ, понимая что вы хотите сказать\n" +
        "\n" +
        "Иногда многим студентам бывает сложно изложить свою мысль и то что они имеют ввиду, посему так как все мы учимся, мы помогаем и корректируем ответы наших студентов.\n" +
        "\n" +
        "\n" +
        "С меня такой интересный контент, с вас поддержка и реакции на данные посты!📈🔥",
  },
  {
    id: 5,
    title: "Отзыв по книге PostgreSQL",
    blogs_text: "И так, пишу отзыв по данной книге👇🏻\n" +
        "\n" +
        "Прочитав около 100 страниц данной книги, могу с уверенностью сказать что это годная книга для освоения основ языка SQL.\n" +
        "\n" +
        "Почему?\n" +
        "\n" +
        "1. Здесь все максимально расписано\n" +
        "2. Много информации\n" +
        "3. Есть четкие и интуитивно понятные примеры\n" +
        "4. Есть все ссылки на исходники (то есть откуда берется материал для обучения)\n" +
        "\n" +
        "НО!\n" +
        "\n" +
        "Есть единственный минус ➖\n" +
        "Учиться по книге будет сложновато начинающим программистам, у которых очень мало опыта за плечами.\n" +
        "\n" +
        "Потому что в некоторых моментах, человек может не понять что от него требует обучающий материал, то есть ступор от того что не понимаешь, а что дальше то мне делать?\n" +
        "\n" +
        "Такой вот отзыв сложился у меня после 100 страниц родные\n" +
        "\n" +
        "С вас реакции на посты, с меня контент интересный❤️🔥",
  },
  {
    id: 6,
    title: "Lincode-Avito",
    blogs_text: "Народ, всем привет🖖\n" +
        "\n" +
        "Снова делюсь прогрессом работы над приложением «демо-авито»\n" +
        "\n" +
        "И так вот что было сделано с момента последнего поста:\n" +
        "\n" +
        "1. Мы добили практический всю запланированную верстку🔥📈\n" +
        "\n" +
        "2. Мы реализовали конструкцию роутинга(переключение страниц)📈\n" +
        "\n" +
        "3. Реализовали DropDown menu (выпадающее меню при клике).\n" +
        "\n" +
        "Сегодня наконец мы начали работу над материалом 3 этапа.\n" +
        "3 этап у нас вбирает в себя серверную часть, то есть весь этап целиком посвящен именно бэкенду(серверной части)📃\n" +
        "В данном этапе мы подробно описываем весь процесс касаемый серверной части, то есть установке, настройке, запуску и прочее.\n" +
        "\n" +
        "Далее в планах:\n" +
        "\n" +
        "1. Закончить расписывать материал по 3 этапу\n" +
        "\n" +
        "2. Записать видео по 3 этапу\n" +
        "\n" +
        "3. Переработать приложение в соответствии с нашими данными с сервера\n" +
        "\n" +
        "4. Отрефакторить некоторые косяки которые были допущены в процессе реализации верстки\n" +
        "\n" +
        "5. Реализовать страницу избранное\n" +
        "\n" +
        "6. Реализовать функционал добавления объявления в избранное\n" +
        "\n" +
        "И многое другое😏\n" +
        "\n" +
        "Поддержите нас лайками под этим постом, ведь мы стараемся для вас, для своих студентов и для людей которые интересуются миром программирования😊🔥",
  },
  {
    id: 7,
    title: "Lincode-Avito",
    blogs_text: "Hello народ🖖🏻\n" +
        "\n" +
        "Не опять а снова, делимся прогрессом нашей работы над нашим большим проектом \"демо-авито\" от курса Lincode🧑‍💻\n" +
        "\n" +
        "Мы уже подготовили довольно-таки большой материал по данному проекту, как видно на скринах, мы уже расписали все этапы начиная с \"ЭТАП 0\" до \"ЭТАП 4\"\n" +
        "\n" +
        "Так же мы уже записали около 8-10 видеоуроков по реализации каждого этапа последовательно📈\n" +
        "\n" +
        "Планы описанные в предыдущем посте по поводу страниц, немного изменились.\n" +
        "Мы решили не делать настолько большой проект, потому что данная разработка очень сильно затянется\n" +
        "\n" +
        "Вместо этого мы решили сделать не большой но крутой проект для наших студентов, чтобы они могли использовать все свои знания которые они получили в рамках нашего курса и так же чтобы доказать им что они уже с нынешними знаниями могут реализовывать такие проекты ( к слову, о которых они и не мечтали в начале нашего обучения )\n" +
        "\n" +
        "Сейчас на данном этапе у нас в планах доработать материал по 5 этапу, далее записать видео по данному этапу и уже конечно же по тихоньку начинать реализовывать функциональную часть нашего проекта.\n" +
        "\n" +
        "Надеемся на вашу поддержку и теплые слова родные❤️‍🔥\n" +
        "Ведь вы и есть источник нашего вдохновения и мотивации🔥",
  },
  {
    id: 8,
    title: "Итоги работы над проектом Lincode-Avito",
    blogs_text: "Ассаламу алейкум ва рахьматуллах1 народ✊🏽\n" +
        "\n" +
        "Хочу поделиться итогами работы над нашим проектом «демо-авито»\n" +
        "\n" +
        "Мы завершили данный проект не сказать что полностью, но завершили🥳\n" +
        "\n" +
        "Что мы смогли сделать в рамках курса?\n" +
        "1. Создать само приложение\n" +
        "2. Сверстать все страницы кроме(страницы настроек)\n" +
        "3. Добавить функционал переключения страниц\n" +
        "4. Добавить выпадающее меню\n" +
        "5. Поработать над стилями проекта\n" +
        "6. Создать свой локальный сервер\n" +
        "7. Создать базу данных\n" +
        "8. Добавить около 12-ти штук объявлений в базу данных\n" +
        "9. Разработать функционал взаимодействия клиента с сервером\n" +
        "10. Отрисовка полученных данных\n" +
        "11. Добавление новых объявлений от пользователя\n" +
        "12. Поработать над слайдером\n" +
        "\n" +
        "И многие другие мелкие вещи\n" +
        "\n" +
        "Как по мне это огромная работа, это огромная мотивация для меня и для моих студентов\n" +
        "\n" +
        "Почему это мотивация для меня?\n" +
        "Потому что я своим примером, смог показать своим студентам что они могут сделать с нынешними знаниями💯\n" +
        "\n" +
        "Почему для студентов это мотивация?\n" +
        "Потому что они смогли увидеть что они могут сделать, на что они способны уже сейчас🔥\n" +
        "\n" +
        "Мы работаем ясное дело чтобы заработать, это была бы ложь если бы мы говорили, что мы не ради денег работаем. \n" +
        "\n" +
        "Однако, кроме денег, здесь есть еще кое что!\n" +
        "Что это?\n" +
        "\n" +
        "Это настолько приятные отзывы от студентов, настолько по достоинству оценённая работа наставника, я могу продолжать еще долго этот список.\n" +
        "\n" +
        "Знаете как приятно видеть, что благодаря тебе, парни и девушки, мужчины и женщины, люди которые абсолютно не имели понятие о том что такое программирование, начинают понимать что это такое, начинают уже с первых уроков показывать какие-то результаты и сами радуются и не понимают как я смог(ла) это сделать прямо на первом же уроке???\n" +
        "\n" +
        "Ахахах, правда все это очень приятно видеть, читать, слышать\n" +
        "\n" +
        "Я искренне ценю каждого своего студента, ведь благодаря моим студентам, учатся не только они, учусь и я тоже, расту и я тоже вместе с ними))\n" +
        "\n" +
        "\n" +
        "Спасибо вам всем огромное❤️‍🔥\n" +
        "Спасибо за каждую реакцию, за каждый комментарий, за каждое доброе слово сказанное в мой, в наш адрес☺️\n" +
        "Вы все молодцы💯",
  },
];
